In [1]:
import pandas as pd 
import sqlite3
import matplotlib.pyplot as plt

In [2]:
#connect my db with sql database
conn = sqlite3.connect('superstore_database.db')
cursor = conn.cursor()

In [15]:
sql_query = """
    select c.CustomerName, c.State, count(*) from customers c 
    join orders o on c.CustomerID = o.CustomerID join sales s on o.OrderID=s.OrderID group by  c.CustomerName order by count(*) desc limit 10 
"""
pd.read_sql(sql_query, conn)

          CustomerName         State  count(*)
0        William Brown  Pennsylvania        37
1           Paul Prost       Georgia        34
2         Matt Abelman         Texas        34
3             John Lee    California        34
4          Seth Vernon      Delaware        32
5     Jonathan Doherty  Pennsylvania        32
6         Edward Hooks      New York        32
7  Chloris Kastensmidt  Pennsylvania        32
8     Zuschuss Carroll        Oregon        31
9           Emily Phan      Illinois        31

In [14]:
sql_query = """
    select c.CustomerName, c.State, count(*) from customers c 
    join orders o on c.CustomerID = o.CustomerID join sales s on o.OrderID=s.OrderID group by  c.State order by count(*) desc limit 10 
"""
pd.read_sql(sql_query, conn)

      CustomerName           State  count(*)
0  Darrin Van Huff      California      1998
1   Janet Molinari        New York      1110
2    Harold Pawlan           Texas       917
3  Sandra Flanagan    Pennsylvania       641
4   Linda Cazamias        Illinois       574
5       Ryan Crowe            Ohio       480
6     Irene Maddox      Washington       460
7     Andrew Allen  North Carolina       343
8    Brendan Sweed         Arizona       301
9   Sean O'Donnell         Florida       290